_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 198, 128)          19328     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 66, 128)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 66, 256)           229632    
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 66, 96)            122976    
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 66, 128)           36992     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 22, 128)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 22, 196)           125636    
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 22, 128)           75392     
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 22, 96)            61536     
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 22, 128)           36992     
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 22, 196)           125636    
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 22, 128)           175744    
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 22, 96)            36960     
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 7, 96)             0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 7, 196)            94276     
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 7, 128)            175744    
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 2, 128)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 2, 196)            125636    
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 2, 128)            175744    
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 2, 96)             36960     
_________________________________________________________________
flatten_1 (Flatten)          (None, 192)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 386       
=================================================================
Total params: 1,660,470
Trainable params: 1,660,470
Non-trainable params: 0
_________________________________________________________________
