_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 50)          4900      
_________________________________________________________________
bidirectional_1 (Bidirection (None, 256)               183296    
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 514       
=================================================================
Total params: 188,710
Trainable params: 188,710
Non-trainable params: 0
_________________________________________________________________
