_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 198, 128)          19328     
_________________________________________________________________
flatten_1 (Flatten)          (None, 25344)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 50690     
=================================================================
Total params: 74,918
Trainable params: 74,918
Non-trainable params: 0
_________________________________________________________________
