_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 198, 128)          19328     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 66, 128)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 66, 128)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 66, 256)           229632    
_________________________________________________________________
dropout_2 (Dropout)          (None, 66, 256)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 66, 96)            122976    
_________________________________________________________________
dropout_3 (Dropout)          (None, 66, 96)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 66, 128)           36992     
_________________________________________________________________
dropout_4 (Dropout)          (None, 66, 128)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 66, 196)           125636    
_________________________________________________________________
dropout_5 (Dropout)          (None, 66, 196)           0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 66, 128)           75392     
_________________________________________________________________
dropout_6 (Dropout)          (None, 66, 128)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 66, 96)            61536     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 22, 96)            0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 22, 96)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 22, 128)           36992     
_________________________________________________________________
dropout_8 (Dropout)          (None, 22, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 22, 196)           125636    
_________________________________________________________________
dropout_9 (Dropout)          (None, 22, 196)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 22, 128)           175744    
_________________________________________________________________
dropout_10 (Dropout)         (None, 22, 128)           0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 22, 96)            36960     
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 7, 96)             0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 7, 96)             0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 672)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1346      
=================================================================
Total params: 1,053,070
Trainable params: 1,053,070
Non-trainable params: 0
_________________________________________________________________
