_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
dense_1 (Dense)              (None, 200, 128)          6528      
_________________________________________________________________
dense_2 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
dense_3 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
dense_4 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
dense_5 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
dense_6 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
dense_7 (Dense)              (None, 200, 128)          16512     
_________________________________________________________________
flatten_1 (Flatten)          (None, 25600)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 51202     
=================================================================
Total params: 161,702
Trainable params: 161,702
Non-trainable params: 0
_________________________________________________________________
