_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
dense_1 (Dense)              (None, 200, 128)          6528      
_________________________________________________________________
flatten_1 (Flatten)          (None, 25600)             0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 51202     
=================================================================
Total params: 62,630
Trainable params: 62,630
Non-trainable params: 0
_________________________________________________________________
