_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 200, 50)           4900      
_________________________________________________________________
seq_self_attention_1 (SeqSel (None, 200, 50)           3265      
_________________________________________________________________
flatten_1 (Flatten)          (None, 10000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 20002     
=================================================================
Total params: 28,167
Trainable params: 28,167
Non-trainable params: 0
_________________________________________________________________
